Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/hooks-faq_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: If you miss automatic merging, you could write a custom `useLegacyState` Hook that merges object state updates.
ja: 自動マージがないとつらい場合は、`useLegacyState` のようなカスタムフックを書いてオブジェクト型の state の更新をマージするようにすることはできます。

source: However, **we recommend to split state into multiple state variables based on which values tend to change together.**
ja: しかし、我々は代わりに、**どの値が一緒に更新されやすいのかに基づいて、state を複数の state 変数に分割することをお勧めします。**

source: For example, we could split our component state into `position` and `size` objects, and always replace the `position` with no need for merging:
ja: 例えば、コンポーネントの state を `position` と `size` という複数のオブジェクトに分割して、マージを行わなくても `position` を常に新たな値で置換するようにできるでしょう。

source: Separating independent state variables also has another benefit.
ja: 互いに独立した state 変数を分割することには別の利点もあります。

source: It makes it easy to later extract some related logic into a custom Hook, for example:
ja: そうすることで後からそのロジックをカスタムフックに抽出しやすくなるのです。例えば：

source: Note how we were able to move the `useState` call for the `position` state variable and the related effect into a custom Hook without changing their code.
ja: `position` の state 変数に対する `useState` の呼び出しとそれに関連する副作用を、それらのコードを変えずにカスタムフックに移行できたことに注意してください。

source: If all state was in a single object, extracting it would be more difficult.
ja: もしすべての state が単一のオブジェクトに入っていたら、抽出するのはもっと困難だったでしょう。

source: Both putting all state in a single `useState` call, and having a `useState` call per each field can work.
ja: すべての state を 1 つの `useState` 呼び出しに含めても動作しますし、フィールドごとに別に `useState` を持たせることでも動作はします。

source: Components tend to be most readable when you find a balance between these two extremes, and group related state into a few independent state variables.
ja: しかしこれらの両極端の間でうまくバランスを取り、少数の独立した state 変数に関連する state をグループ化することで、コンポーネントは最も読みやすくなります。

source: If the state logic becomes complex, we recommend [managing it with a reducer](/docs/hooks-reference.html#usereducer) or a custom Hook.
ja: state のロジックが複雑になった場合は、それを[リデューサで管理する](/docs/hooks-reference.html#usereducer)か、カスタムフックを書くことをお勧めします。

source: ### Can I run an effect only on updates?
ja: ### コンポーネントの更新のときだけ副作用を実行することは可能ですか？

source: This is a rare use case.
ja: これは稀なユースケースです。

source: If you need it, you can [use a mutable ref](#is-there-something-like-instance-variables) to manually store a boolean value corresponding to whether you are on the first or a subsequent render, then check that flag in your effect. (If you find yourself doing this often, you could create a custom Hook for it.)
ja: 必要であれば、[変更可能な ref](#is-there-something-like-instance-variables) を使って、初回レンダー中なのか更新中なのかに対応する真偽値を手動で保持し、副作用内でその値を参照するようにすることができます（このようなことを何度もやる場合は、そのためのカスタムフックを書くことができます）。

source: ### How to get the previous props or state?
ja: ### 前回の props や state はどうすれば取得できますか？

source: Currently, you can do it manually [with a ref](#is-there-something-like-instance-variables):
ja: 現時点では、これは [ref を使って](#is-there-something-like-instance-variables)手動で行うことができます：

source: This might be a bit convoluted but you can extract it into a custom Hook:
ja: 上記はちょっと複雑かもしれませんが、これをカスタムフックに抽出することができます。

source: Note how this would work for props, state, or any other calculated value.
ja: これは props でも state でも、その他計算されたどのような値に対しても動作します。

source: It's possible that in the future React will provide a `usePrevious` Hook out of the box since it's a relatively common use case.
ja: これは比較的よくあるユースケースですので、将来的に `usePrevious` というフックを React が最初から提供するようにする可能性があります。

source: See also [the recommended pattern for derived state](#how-do-i-implement-getderivedstatefromprops).
ja: [派生 state における推奨されるパターン](#how-do-i-implement-getderivedstatefromprops)についても参照してください。

source: ### Why am I seeing stale props or state inside my function?
ja: ### 関数内で古い props や state が見えているのはなぜですか？

source: Any function inside a component, including event handlers and effects, "sees" the props and state from the render it was created in.
ja: イベントハンドラにせよ副作用関数にせよ、コンポーネント内に書かれた関数からは、その関数が作成された時の props や state が「見え」ます。

source: For example, consider code like this:
ja: 以下のような例を考えてみましょう：

source: If you first click "Show alert" and then increment the counter, the alert will show the `count` variable **at the time you clicked the "Show alert" button**.
ja: 最初に "Show alert" ボタンをクリックして、次にカウンタを増加させた場合、アラートダイアログに表示されるのは **"Show alert" ボタンをクリックした時点での** `count` 変数の値になります。

source: This prevents bugs caused by the code assuming props and state don't change.
ja: これにより props や state が変わらないことを前提として書かれたコードによるバグが防止できます。

source: If you intentionally want to read the *latest* state from some asynchronous callback, you could keep it in [a ref](/docs/hooks-faq.html#is-there-something-like-instance-variables), mutate it, and read from it.
ja: 非同期的に実行されるコールバック内で、意図的に state の*最新*の値を読み出したいという場合は、その値を [ref](/docs/hooks-faq.html#is-there-something-like-instance-variables) 内に保持して、それを書き換えたり読み出したりすることができます。

source: Finally, another possible reason you're seeing stale props or state is if you use the "dependency array" optimization but didn't correctly specify all the dependencies.
ja: 最後に、古い props や state が見えている場合に考えられる他の理由は、「依存の配列」による最適化を使った際に正しく依存する値の全部を指定しなかった、というものです。

source: For example, if an effect specifies `[]` as the second argument but reads `someProp` inside, it will keep "seeing" the initial value of `someProp`.
ja: 例えば副作用フックの第 2 引数に `[]` を指定したにも関わらず副作用内で `someProps` を読み出しているという場合、副作用関数内では `someProps` の初期値がずっと見え続けることになります。

source: The solution is to either remove the dependency array, or to fix it.
ja: 解決方法は依存配列自体を削除するか、配列の中身を修正することです。

source: Here's [how you can deal with functions](#is-it-safe-to-omit-functions-from-the-list-of-dependencies), and here's [other common strategies](#what-can-i-do-if-my-effect-dependencies-change-too-often) to run effects less often without incorrectly skipping dependencies.
ja: [関数の扱い方](#is-it-safe-to-omit-functions-from-the-list-of-dependencies)、および依存する値の変化を誤って無視することなく副作用の実行回数を減らすための[よくある手法](#what-can-i-do-if-my-effect-dependencies-change-too-often)についてもご覧ください。

source: >Note > >We provide an [`exhaustive-deps`](https://github.com/facebook/react/issues/14920) ESLint rule as a part of the [`eslint-plugin-react-hooks`](https://www.npmjs.com/package/eslint-plugin-react-hooks#installation) package.
ja: >補足 > > [`exhaustive-deps`](https://github.com/facebook/react/issues/14920) という ESLint のルールを [`eslint-plugin-react-hooks`](https://www.npmjs.com/package/eslint-plugin-react-hooks#installation) パッケージの一部として提供しています。

source: It warns when dependencies are specified incorrectly and suggests a fix.
ja: 依存配列が正しく指定されていない場合に警告し、修正を提案します。

source: ### How do I implement `getDerivedStateFromProps`?
ja: ### どうすれば `getDerivedStateFromProps` を実装できますか？

source: While you probably [don't need it](/blog/2018/06/07/you-probably-dont-need-derived-state.html), in rare cases that you do (such as implementing a `<Transition>` component), you can update the state right during rendering.
ja: おそらくそのようなものは[必要ない](/blog/2018/06/07/you-probably-dont-need-derived-state.html)のですが、これが本当に必要になる稀なケースでは（例えば `<Transition>` コンポーネントを実装するときなど）、レンダーの最中に state を更新することができます。

source: React will re-run the component with updated state immediately after exiting the first render so it wouldn't be expensive.
ja: React は最初のレンダーの終了直後に更新された state を使ってコンポーネントを再実行しますので、計算量は高くなりません。

source: Here, we store the previous value of the `row` prop in a state variable so that we can compare:
ja: 以下の例では、`row` プロパティの前回の値を state 変数に格納し後で比較できるようにしています：

source: This might look strange at first, but an update during rendering is exactly what `getDerivedStateFromProps` has always been like conceptually.
ja: これは最初は奇妙に見えるかもしれませんが、これまでも概念的には `getDerivedStateFromProps` はレンダー中に更新を行うというのがまさに目的でした。

source: ### Is there something like forceUpdate?
ja: ### forceUpdate のようなものはありますか？

source: Both `useState` and `useReducer` Hooks [bail out of updates](/docs/hooks-reference.html#bailing-out-of-a-state-update) if the next value is the same as the previous one.
ja: `useState` フックと `useReducer` フックのいずれも、前回と今回で値が同じである場合は[更新を回避](/docs/hooks-reference.html#bailing-out-of-a-state-update)します。

source: Mutating state in place and calling `setState` will not cause a re-render.
ja: 適当な場所で state を変化させた後に `setState` を呼び出しても再レンダーは発生しません。

source: Normally, you shouldn't mutate local state in React.
ja: 通常、React でローカル state を直接変更すべきではありません。

source: However, as an escape hatch, you can use an incrementing counter to force a re-render even if the state has not changed:
ja: しかし避難ハッチとして、カウンターを使って state が変化していない場合でも再レンダーを強制することが可能です。

source: Try to avoid this pattern if possible.
ja: 可能であればこのパターンは避けるようにしてください。

source: ### Can I make a ref to a function component?
ja: ### 関数コンポーネントへの ref を作ることは可能ですか？

source: While you shouldn't need this often, you may expose some imperative methods to a parent component with the [`useImperativeHandle`](/docs/hooks-reference.html#useimperativehandle) Hook.
ja: このようなことをする必要はあまりないはずですが、命令型のメソッドを親コンポーネントに公開するために [`useImperativeHandle`](/docs/hooks-reference.html#useimperativehandle) フックを利用することができます。

source: ### How can I measure a DOM node?
ja: ### DOM ノードの位置やサイズの測定はどのように行うのですか？

source: One rudimentary way to measure the position or size of a DOM node is to use a [callback ref](/docs/refs-and-the-dom.html#callback-refs).
ja: DOM ノードの位置やサイズを測定するための基本的な方法として、[コールバック形式の ref](/docs/refs-and-the-dom.html#callback-refs) が利用できます。

source: React will call that callback whenever the ref gets attached to a different node.
ja: React は ref が異なるノードに割り当てられるたびにコールバックを呼び出します。

source: Here is a [small demo](https://codesandbox.io/s/l7m0v5x4v9):
ja: こちらの[小さなデモ](https://codesandbox.io/s/l7m0v5x4v9)をご覧ください。

source: We didn't choose `useRef` in this example because an object ref doesn't notify us about *changes* to the current ref value.
ja: この例で `useRef` を使わなかったのは、オブジェクト型の ref には現在値が変わった時にそれを通知する機能がないためです。

source: Using a callback ref ensures that [even if a child component displays the measured node later](https://codesandbox.io/s/818zzk8m78) (e.g. in response to a click), we still get notified about it in the parent component and can update the measurements.
ja: コールバック ref を使うことで、[子コンポーネントが測定されたノードを（例えばクリックに応じて）後から表示する場合でも](https://codesandbox.io/s/818zzk8m78)、親コンポーネントの側でその変更について通知を受け取り、測定値を反映させることができます。

source: Note that we pass `[]` as a dependency array to `useCallback`.
ja: `useCallback` の依存値の配列として `[]` を渡したことに注意してください。

source: This ensures that our ref callback doesn't change between the re-renders, and so React won't call it unnecessarily.
ja: これにより我々の ref コールバックが再レンダーごとに変化しないことが保証され、React が不必要にその関数を呼ばないで済みます。

source: In this example, the callback ref will be called only when the component mounts and unmounts, since the rendered `` component stays present throughout any rerenders.
ja: この例では、レンダーされている `` はどの再レンダー間でも同じように存在するため、コールバック ref はコンポーネントのマウント時とアンマウント時にのみ呼び出されます。

source: If you want to be notified any time a component resizes, you may want to use [`ResizeObserver`](https://developer.mozilla.org/en-US/docs/Web/API/ResizeObserver) or a third-party Hook built on it.
ja: コンポーネントのリサイズが発生した際に毎回通知を受け取りたい場合は、[`ResizeObserver`](https://developer.mozilla.org/en-US/docs/Web/API/ResizeObserver) や、これを使って作成されているサードパーティのフックの利用を検討してください。

source: If you want, you can [extract this logic](https://codesandbox.io/s/m5o42082xy) into a reusable Hook:
ja: お望みであれば再利用可能なフックとして[このロジックを抽出](https://codesandbox.io/s/m5o42082xy)できます。

source: ### What does `const [thing, setThing] = useState()` mean?
ja: ### `const [thing, setThing] = useState()` というのはどういう意味ですか？

source: If you're not familiar with this syntax, check out the [explanation](/docs/hooks-state.html#tip-what-do-square-brackets-mean) in the State Hook documentation.
ja: この構文に馴染みがない場合はステートフックのドキュメント内の[説明](/docs/hooks-state.html#tip-what-do-square-brackets-mean)をご覧ください。

source: ## Performance Optimizations {#performance-optimizations}
ja: ## パフォーマンス最適化 {#performance-optimizations}

source: ### Can I skip an effect on updates?
ja: ### 更新時に副作用をスキップすることはできますか？

source: Yes.
ja: はい。

source: See [conditionally firing an effect](/docs/hooks-reference.html#conditionally-firing-an-effect).
ja: [条件付きで副作用を実行する](/docs/hooks-reference.html#conditionally-firing-an-effect)を参照してください。

source: Note that forgetting to handle updates often [introduces bugs](/docs/hooks-effect.html#explanation-why-effects-run-on-each-update), which is why this isn't the default behavior.
ja: これがデフォルトの動作になっていないのは、更新時の対応を忘れることが[バグの元になる](/docs/hooks-effect.html#explanation-why-effects-run-on-each-update)からです。

source: ### Is it safe to omit functions from the list of dependencies?
ja: ### 依存の配列から関数を省略しても大丈夫ですか？

source: Generally speaking, no.
ja: いいえ、一般的には省略できません。

source: It's difficult to remember which props or state are used by functions outside of the effect.
ja: 副作用関数の外側にある関数内でどの props や state が使われているのか覚えておくのは大変です。

source: This is why **usually you'll want to declare functions needed by an effect *inside* of it.** Then it's easy to see what values from the component scope that effect depends on:
ja: ですので**副作用関数内で使われる関数は副作用関数内で宣言する**のがよいでしょう。そうすればコンポーネントスコープ内のどの値に副作用が依存しているのかを把握するのは容易です。

source: If after that we still don't use any values from the component scope, it's safe to specify `[]`:
ja: このようにした後で、やはりコンポーネントスコープ内のどの値も使用していないのであれば、`[]` を指定することは安全です：

source: Depending on your use case, there are a few more options described below.
ja: ユースケースによっては、以下に述べるような選択肢もあります。

source: >Note > >We provide the [`exhaustive-deps`](https://github.com/facebook/react/issues/14920) ESLint rule as a part of the [`eslint-plugin-react-hooks`](https://www.npmjs.com/package/eslint-plugin-react-hooks#installation) package.
ja: >補足 > > [`eslint-plugin-react-hooks`](https://www.npmjs.com/package/eslint-plugin-react-hooks#installation) パッケージの一部として [`exhaustive-deps`](https://github.com/facebook/react/issues/14920) という ESLint のルールを提供しています。

source: It helps you find components that don't handle updates consistently.
ja: 更新の一貫性が保たれていないコンポーネントを見つけるのに役立ちます。

source: Let's see why this matters.
ja: これがなぜ重要なのか説明します。

source: If you specify a [list of dependencies](/docs/hooks-reference.html#conditionally-firing-an-effect) as the last argument to `useEffect`, `useLayoutEffect`, `useMemo`, `useCallback`, or `useImperativeHandle`, it must include all values that are used inside the callback and participate in the React data flow.
ja: `useEffect`、`useLayoutEffect`、`useMemo`、`useCallback` あるいは `useImperativeHandle` の最後の引数として[依存する値のリスト](/docs/hooks-reference.html#conditionally-firing-an-effect)を渡す場合、コールバック内部で使われ React のデータの流れに関わる値が、すべて含まれている必要があります。

source: That includes props, state, and anything derived from them.
ja: すなわち props や state およびそれらより派生するあらゆるものです。

source: It is **only** safe to omit a function from the dependency list if nothing in it (or the functions called by it) references props, state, or values derived from them.
ja: 関数を依存のリストから安全に省略できるのは、その関数（あるいはその関数から呼ばれる関数）が props、state ないしそれらから派生する値のいずれも含んでいない場合**のみ**です。

source: This example has a bug:
ja: 以下の例にはバグがあります。

source: **The recommended fix is to move that function _inside_ of your effect**.
ja: **推奨される修正方法は、この関数を副作用*内*に移動することです。

source: That makes it easy to see which props or state your effect uses, and to ensure they're all declared:
ja: **これにより、副作用がどの props や state を利用しているのか把握しやすくなり、それらが指定されていることを保証しやすくなります。

source: This also allows you to handle out-of-order responses with a local variable inside the effect:
ja: これにより、要らなくなったレスポンスに対して副作用内でローカル変数を使って対処することも可能になります。

source: We moved the function inside the effect so it doesn't need to be in its dependency list.
ja: 副作用内に関数を移動したことで、依存リスト内にこの関数を含めないでよくなりました。

source: >Tip > >Check out [this small demo](https://codesandbox.io/s/jvvkoo8pq3) and [this article](https://www.robinwieruch.de/react-hooks-fetch-data/) to learn more about data fetching with Hooks.
ja: >ヒント > >フックでデータを取得する方法について[こちらの小さなデモ](https://codesandbox.io/s/jvvkoo8pq3)および[こちらの記事](https://www.robinwieruch.de/react-hooks-fetch-data/)をご覧ください。

source: **If for some reason you _can't_ move a function inside an effect, there are a few more options:**
ja: **何らかの理由で副作用内に関数を移動*できない*という場合、他にとりうる選択肢がいくつかあります。**

source: * **You can try moving that function outside of your component**.
ja: * **そのコンポーネントの外部にその関数を移動できないか考えましょう**。

source: In that case, the function is guaranteed to not reference any props or state, and also doesn't need to be in the list of dependencies.
ja: その場合、関数は props や state を参照していないことが保証されるので、依存のリストに含まずに済むようになります。

source: * If the function you're calling is a pure computation and is safe to call while rendering, you may **call it outside of the effect instead,** and make the effect depend on the returned value.
ja: * 使おうとしている関数が純粋な計算のみを行い、レンダー中に呼んで構わないものであるなら、その関数を代わりに**副作用の外部で呼ぶ**ようにして、副作用中ではその返り値に依存するようにします。

source: * As a last resort, you can **add a function to effect dependencies but _wrap its definition_** into the [`useCallback`](/docs/hooks-reference.html#usecallback) Hook.
ja: * 最終手段として、関数を依存リストに加えつつ、[`useCallback`](/docs/hooks-reference.html#usecallback) を使って**その定義をラップする**ことが可能です。

source: This ensures it doesn't change on every render unless *its own* dependencies also change:
ja: これにより、*関数自体*の依存が変わらない限り関数も変化しないことを保証できます。

source: Note that in the above example we **need** to keep the function in the dependencies list.
ja: 上記の例では関数を依存リストに含める**必要がある**ことに注意してください。

source: This ensures that a change in the `productId` prop of `ProductPage` automatically triggers a refetch in the `ProductDetails` component.
ja: これにより `ProductPage` の `productId` プロパティが変化した場合に自動的に `ProductDetail` コンポーネント内でデータの再取得が発生するようになります。

source: ### What can I do if my effect dependencies change too often?
ja: ### 副作用の依存リストが頻繁に変わりすぎる場合はどうすればよいですか？

source: Sometimes, your effect may be using state that changes too often.
ja: しばしば、ある副作用がとても頻繁に変化する state を利用しないといけない場合があります。

source: You might be tempted to omit that state from a list of dependencies, but that usually leads to bugs:
ja: 依存のリストからその state を省略したくなるかもしれませんが、通常それはバグになります。

source: The empty set of dependencies, `[]`, means that the effect will only run once when the component mounts, and not on every re-render.
ja: 依存のリストが空であるということ (`[]`) は、コンポーネントのマウント時に副作用が一度のみ実行され、毎回の再レンダー時には実行されないということを意味します。

source: The problem is that inside the `setInterval` callback, the value of `count` does not change, because we've created a closure with the value of `count` set to `0` as it was when the effect callback ran.
ja: ここでの問題は、副作用コールバックが実行された時点で `count` の値が `0` に設定されたクロージャを作成したため、`setInterval` 内のコールバックで `count` の値が変わらなくなってしまう、ということです。

source: Every second, this callback then calls `setCount(0 + 1)`, so the count never goes above 1.
ja: 毎秒ごとにこのコールバックは `setCount(0 + 1)` を呼び出すので、カウントは 1 のまま変わらなくなってしまいます。

source: Specifying `[count]` as a list of dependencies would fix the bug, but would cause the interval to be reset on every change.
ja: 依存のリストとして `[count]` を指定すればバグは起きなくなりますが、その場合値が変化するたびにタイマーがリセットされることになります。

source: Effectively, each `setInterval` would get one chance to execute before being cleared (similar to a `setTimeout`.) That may not be desirable.
ja: 事実上それぞれの `setInterval` は一度しか実行されずに（`setTimeout` のように）クリアされてしまうのです。これは望ましい動作ではありません。

source: To fix this, we can use the [functional update form of `setState`](/docs/hooks-reference.html#functional-updates).
ja: これを修正するため、[`setState` 関数形式による更新](/docs/hooks-reference.html#functional-updates)を利用することができます。

source: It lets us specify *how* the state needs to change without referencing the *current* state:
ja: これにより state の*現在値*を参照せずに state が*どのように*更新されるべきかを指定できます。

source: (The identity of the `setCount` function is guaranteed to be stable so it's safe to omit.)
ja: （`setCount` 関数については同一性が保たれることが保証されているので、省略して構いません）

source: Now, the `setInterval` callback executes once a second, but each time the inner call to `setCount` can use an up-to-date value for `count` (called `c` in the callback here.)
ja: これで、`setInterval` のコールバックは 1 秒に 1 回実行されますが、内部の `setCount` は `count` の最新の値（この例では `c`）を参照できるようになります。

source: In more complex cases (such as if one state depends on another state), try moving the state update logic outside the effect with the [`useReducer` Hook](/docs/hooks-reference.html#usereducer).
ja: より複雑なケース（ある state が別の state に依存している場合など）においては、state 更新のロジックを [`useReducer` フック](/docs/hooks-reference.html#usereducer)を使って副作用の外部に移動することを考慮してください。

source: [This article](https://adamrackis.dev/state-and-use-reducer/) offers an example of how you can do this.
ja: [こちらの記事](https://adamrackis.dev/state-and-use-reducer/)にこのやり方についての例があります。

source: **The identity of the `dispatch` function from `useReducer` is always stable** — even if the reducer function is declared inside the component and reads its props.
ja: **`useReducer` から返される `dispatch` 関数は常に同一性が保たれます**。これはリデューサ (reducer) 関数がコンポーネント内で宣言されており props を読み出している場合でも同様です。

source: As a last resort, if you want something like `this` in a class, you can [use a ref](/docs/hooks-faq.html#is-there-something-like-instance-variables) to hold a mutable variable.
ja: 最終手段として、クラスにおける `this` のようなものが欲しい場合は、[ref](/docs/hooks-faq.html#is-there-something-like-instance-variables) を使ってミュータブルな値を保持させることができます。

source: Then you can write and read to it.
ja: そうすればその値を読み書き可能です。

source: For example:
ja: 例えば：

source: Only do this if you couldn't find a better alternative, as relying on mutation makes components less predictable.
ja: ミュータブルな値に依存することでコンポーネントの挙動が予測しづらくなるため、これは代替手段が思いつかない場合にのみ利用してください。

source: If there's a specific pattern that doesn't translate well, [file an issue](https://github.com/facebook/react/issues/new) with a runnable example code and we can try to help.
ja: うまくフックに移行できないパターンがあった場合は動作するコード例を添えて [issue を作成](https://github.com/facebook/react/issues/new)していただければお手伝いします。

source: ### How do I implement `shouldComponentUpdate`?
ja: ### どうすれば `shouldComponentUpdate` を実装できますか？

source: You can wrap a function component with `React.memo` to shallowly compare its props:
ja: 関数コンポーネントを `React.memo` でラップして props を浅く比較するようにしてください。

source: It's not a Hook because it doesn't compose like Hooks do.
ja: これがフックになっていないのは、フックと違って組み合わせ可能ではないからです。

source: `React.memo` is equivalent to `PureComponent`, but it only compares props. (You can also add a second argument to specify a custom comparison function that takes the old and new props.
ja: `React.memo` は `PureComponent` の同等物ですが、props のみを比較するという違いがあります（新旧の props を受け取るカスタムの比較関数を 2 つめの引数として加えることができます。

source: If it returns true, the update is skipped.)
ja: その関数が true を返した場合はコンポーネントの更新はスキップされます）。

source: `React.memo` doesn't compare state because there is no single state object to compare.
ja: `React.memo` は state を比較しませんが、これは比較可能な単一の state オブジェクトが存在しないからです。

source: But you can make children pure too, or even [optimize individual children with `useMemo`](/docs/hooks-faq.html#how-to-memoize-calculations).
ja: しかし子コンポーネント側も純粋にしておくことや、[`useMemo` を使って個々のコンポーネントを最適化する](/docs/hooks-faq.html#how-to-memoize-calculations)ことが可能です。

source: ### How to memoize calculations?
ja: ### 計算結果のメモ化はどのように行うのですか？

source: The [`useMemo`](/docs/hooks-reference.html#usememo) Hook lets you cache calculations between multiple renders by "remembering" the previous computation:
ja: [`useMemo`](/docs/hooks-reference.html#usememo) フックを使うと、前の計算結果を「記憶」しておくことで、複数のレンダー間で計算結果をキャッシュすることができます。

source: This code calls `computeExpensiveValue(a, b)`.
ja: このコードは `computeExpensiveValue(a, b)` を呼び出します。

source: But if the dependencies `[a, b]` haven't changed since the last value, `useMemo` skips calling it a second time and simply reuses the last value it returned.
ja: しかし依存である `[a, b]` の組み合わせが前回の値と変わっていない場合は、`useMemo` はこの関数の 2 回目の呼び出しをスキップし、単に前回返したのと同じ値を返します。

source: Remember that the function passed to `useMemo` runs during rendering.
ja: `useMemo` に渡した関数はレンダー中に実行されるということを覚えておいてください。

source: Don't do anything there that you wouldn't normally do while rendering.
ja: レンダー中に通常やらないようなことをやらないようにしましょう。
